app/controllers/events_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def create
    #accaunt = Accaunt.find(current_user.accaunt_id)

    @event = Event.create(event_params)
    @event.accaunt = Accaunt.find(current_user.accaunt_id)
    @event.user = User.find(current_user)