app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
	def index
    respond_with Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    respond_with Event.find(params[:id])

INSERT INTO "events" ("name", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dsad"], ["description", "dsad"], ["date", "sad"], ["created_at", "2016-09-13 14:48:30.131152"], ["updated_at", "2016-09-13 14:48:30.131152"]]
---
  def create

    @event = Event.create(event_params)