app/controllers/posts_controller.rb

  def index
    respond_with Post.all
---
SELECT "posts".* FROM "posts"

  def create
    respond_with Post.create(post_params.merge(user_id: current_user.id))
---
INSERT INTO "posts" ("link", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link", "dsad"], ["title", "dasd"], ["user_id", 1], ["created_at", "2016-09-07 15:11:12.919425"], ["updated_at", "2016-09-07 15:11:12.919425"]]

  def show
    respond_with Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def upvote
    @post = Post.find(params[:id])
    @post.increment!(:upvotes)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "upvotes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["upvotes", 1], ["updated_at", "2016-09-07 15:11:15.270995"], ["id", 1]]